app/views/prescriptions/show.html.erb

SELECT `problems`.* FROM `problems` WHERE `problems`.`prescription_id` = 1
---
      <div class="col-sm-12">
        <% @prescription.problems.each do |problem| %>

SELECT `prescribed_medicines`.* FROM `prescribed_medicines` WHERE `prescribed_medicines`.`prescription_id` = 1
---
      <div class="col-sm-12">
        <% @prescription.prescribed_medicines.each do |pm| %>

SELECT `medical_tests`.* FROM `medical_tests` WHERE `medical_tests`.`prescription_id` = 1
---
    <div class="row well mt20">
      <% @prescription.medical_tests.each do |mt| %>