app/controllers/appointments_controller.rb

  def create
    @appointment = Appointment.new(appointment_params)
    @appointment.patient_id = current_user.id
    if @appointment.save
---
INSERT INTO `appointments` (`date`, `start_time`, `end_time`, `reason`, `doctor_id`, `patient_id`, `created_at`, `updated_at`) VALUES ('2016-12-11', '2000-01-01 18:24:00', '2000-01-01 18:24:00', 'abcd', 2, 1, '2016-12-09 14:07:48', '2016-12-09 14:07:48')

  def update_status
    @appointment.update(status: params[:status])
---
UPDATE `appointments` SET `status` = 1, `updated_at` = '2016-12-14 22:31:52' WHERE `appointments`.`id` = 4

    def set_appointment
      @appointment = Appointment.find(params[:id])
---
SELECT  `appointments`.* FROM `appointments` WHERE `appointments`.`id` = 4 LIMIT 1