app/controllers/patients_controller.rb

SELECT `appointments`.* FROM `appointments` WHERE `appointments`.`patient_id` = 1 AND (date >= '2016-12-14 22:14:01.455717')
---
  def dashboard
    @patient = current_user
    @appointments = current_user.appointments.upcoming
    @doctors = current_user.connected_doctors
    @all_appointments = current_user.appointments.order(date: :desc)