app/controllers/prescriptions_controller.rb

  def index
    @prescriptions = Prescription.all
---
SELECT `prescriptions`.* FROM `prescriptions`

  def new
    @appointment = Appointment.find(params[:appointment_id])
---
SELECT  `appointments`.* FROM `appointments` WHERE `appointments`.`id` = 1 LIMIT 1

  def create
    @prescription = Prescription.new(prescription_params)
    @prescription.save
---
INSERT INTO `prescriptions` (`current_weight`, `appointment_id`, `created_at`, `updated_at`) VALUES ('', 4, '2016-12-15 00:58:43', '2016-12-15 00:58:43')

    def set_prescription
      @prescription = Prescription.find(params[:id])
---
SELECT  `prescriptions`.* FROM `prescriptions` WHERE `prescriptions`.`id` = 1 LIMIT 1