app/controllers/time_slots_controller.rb

SELECT `time_slots`.* FROM `time_slots`
---
  def index
    @time_slots = TimeSlot.all

INSERT INTO `time_slots` (`day`, `patient_count`, `doctor_id`, `start_time`, `end_time`, `duration`, `created_at`, `updated_at`) VALUES ('Saturday', 30, 6, '2016-12-17 17:00:00.000000', '2016-12-17 10:00:00.000000', -840, '2016-12-17 04:01:33', '2016-12-17 04:01:33')
---
  def create
    day = ''
    time_slot_params.each do |d|
      d.each do |v|
        day = v if v.is_a?(String)
        unless v.is_a?(String)
          @time_slot = TimeSlot.new(v)
          if @time_slot.day == '1'
            @time_slot.day = day
            @time_slot.save